# Aula 01

## 1.0 - Importando Bibliotecas

In [15]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np


# Jupyter config to better experiênce on visualization
%matplotlib inline
%pylab inline
plt.style.use('bmh')
plt.rcParams['figure.figsize'] = [25,12]
plt.rcParams['font.size'] = 24
pd.options.display.max_columns = None
pd.options.display.max_rows = 100
pd.set_option('display.expand_frame_repr', False)

Populating the interactive namespace from numpy and matplotlib

## 2.0 - Coleta de dados

In [16]:
df_house_rocket = pd.read_csv('/home/diegopmayer/Documents/projects/python/pr001_python_zero_ds/dataset/kc_house_data.csv')

## 3.0 - Análise Descritiva

### 3.1 - NaN - Valores Nulos ou None a number

In [17]:
df_house_rocket.isnull().sum().sum(), df_house_rocket.isna().sum().sum()

(0, 0)

### 3.2 - Datatype

In [18]:
dtype = ['int64','object','float64','int64','float64','int64','int64',
         'float64','int64','int64','int64','int64','int64','int64',
         'int64','int64','int64','float64','float64','int64','int64']

df_dtype = df_house_rocket.tail(3).T
df_dtype['dtype'] = dtype
df_dtype

                         21610            21611            21612    dtype
id                  1523300141        291310100       1523300157    int64
date           20140623T000000  20150116T000000  20141015T000000   object
price                 402101.0         400000.0         325000.0  float64
bedrooms                     2                3                2    int64
bathrooms                 0.75              2.5             0.75  float64
sqft_living               1020             1600             1020    int64
sqft_lot                  1350             2388             1076    int64
floors                     2.0              2.0              2.0  float64
waterfront                   0                0                0    int64
view                         0                0                0    int64
condition                    3                3                3    int64
grade                        7                8                7    int64
sqft_above                1020             1600             1020    int64
sqft_basement                0                0                0    int64
yr_built                  2009             2004             2008    int64
yr_renovated                 0                0                0    int64
zipcode                  98144            98027            98144    int64
lat                    47.5944          47.5345          47.5941  float64
long                  -122.299         -122.069         -122.299  float64
sqft_living15             1020             1410             1020    int64
sqft_lot15                2007             1287             1357    int64

In [19]:
# date
# objeto para formato data "datetime"
df_house_rocket['date'] = df_house_rocket['date'].astype('datetime64[ns]').copy()

### 3.3 - Estatística descritiva

In [20]:
# análise descritiva dos dados "eliminando o id"
df_house_rocket.drop('id', axis=1).describe().T

                 count           mean            std         min         25%          50%         75%           max
price          21613.0  540088.141767  367127.196483  75000.0000  321950.000  450000.0000  645000.000  7.700000e+06
bedrooms       21613.0       3.370842       0.930062      0.0000       3.000       3.0000       4.000  3.300000e+01
bathrooms      21613.0       2.114757       0.770163      0.0000       1.750       2.2500       2.500  8.000000e+00
sqft_living    21613.0    2079.899736     918.440897    290.0000    1427.000    1910.0000    2550.000  1.354000e+04
sqft_lot       21613.0   15106.967566   41420.511515    520.0000    5040.000    7618.0000   10688.000  1.651359e+06
floors         21613.0       1.494309       0.539989      1.0000       1.000       1.5000       2.000  3.500000e+00
waterfront     21613.0       0.007542       0.086517      0.0000       0.000       0.0000       0.000  1.000000e+00
view           21613.0       0.234303       0.766318      0.0000       0.000       0.0000       0.000  4.000000e+00
condition      21613.0       3.409430       0.650743      1.0000       3.000       3.0000       4.000  5.000000e+00
grade          21613.0       7.656873       1.175459      1.0000       7.000       7.0000       8.000  1.300000e+01
sqft_above     21613.0    1788.390691     828.090978    290.0000    1190.000    1560.0000    2210.000  9.410000e+03
sqft_basement  21613.0     291.509045     442.575043      0.0000       0.000       0.0000     560.000  4.820000e+03
yr_built       21613.0    1971.005136      29.373411   1900.0000    1951.000    1975.0000    1997.000  2.015000e+03
yr_renovated   21613.0      84.402258     401.679240      0.0000       0.000       0.0000       0.000  2.015000e+03
zipcode        21613.0   98077.939805      53.505026  98001.0000   98033.000   98065.0000   98118.000  9.819900e+04
lat            21613.0      47.560053       0.138564     47.1559      47.471      47.5718      47.678  4.777760e+01
long           21613.0    -122.213896       0.140828   -122.5190    -122.328    -122.2300    -122.125 -1.213150e+02
sqft_living15  21613.0    1986.552492     685.391304    399.0000    1490.000    1840.0000    2360.000  6.210000e+03
sqft_lot15     21613.0   12768.455652   27304.179631    651.0000    5100.000    7620.0000   10083.000  8.712000e+05

In [26]:
# Soma de registros duplicados
df_house_rocket['id'].duplicated().sum()

177

- Registros duplicados
    - 177 registros duplicados, com isso vamos agrupar para ver se o preço muda

In [34]:
# agrupamento para contar os campos id que estejam duplicados ordenados por maior contagem
df_house_rocket[['id', 'price', 'date']].groupby(by=['id']).count().sort_values(by='price', ascending=False).head()

            price  date
id
795000620       3     3
1000102         2     2
3578401060      2     2
3528000040      2     2
4345000510      2     2

- Vamos pegar o primeiro registro acima e ver os dados duplicados para analisar
    - 795000620
        - como pode ver abaixo; todos os dados se repetem com exceção de date e price, e tem lógica de negócio, visto que os imóveis tentem a valorizar ao longo dos anos, com isso, a data mais atuliazada estará mais cara.
        - Solução aqui será pegar a data mais atualizada e eliminar as outras datas.

In [35]:
df_house_rocket[df_house_rocket['id'] == 795000620]

              id       date     price  bedrooms  bathrooms  sqft_living  sqft_lot  floors  waterfront  view  condition  grade  sqft_above  sqft_basement  yr_built  yr_renovated  zipcode      lat    long  sqft_living15  sqft_lot15
17602  795000620 2014-09-24  115000.0         3        1.0         1080      6250     1.0           0     0          2      5        1080              0      1950             0    98168  47.5045 -122.33           1070        6250
17603  795000620 2014-12-15  124000.0         3        1.0         1080      6250     1.0           0     0          2      5        1080              0      1950             0    98168  47.5045 -122.33           1070        6250
17604  795000620 2015-03-11  157000.0         3        1.0         1080      6250     1.0           0     0          2      5        1080              0      1950             0    98168  47.5045 -122.33           1070        6250

In [56]:
# passar pelas linhas e se o registro for igual a data max então retorna o valor da linha else 0

# transformar a data em inteiro para poder comparar os valores
df_house_rocket['date_int'] = df_house_rocket['date'].astype('int')

In [71]:
df_house_rocket[['id', 'date', 'price']].groupby(by=['id']).count().sort_values(by='price')

                 date     price
id
9842300095 2014-07-25  365000.0
9842300485 2015-03-11  380000.0
9842300540 2014-06-24  339000.0
9895000040 2014-07-03  399900.0
9900000190 2014-10-30  268950.0

In [73]:
df_house_rocket[['id', 'date', 'price']].groupby(by=['id']).count().sort_values(by='price', ascending=False).head()

            date  price
id
795000620      3      3
1000102        2      2
3578401060     2      2
3528000040     2      2
4345000510     2      2

In [75]:
df_house_rocket[df_house_rocket['id'] == 795000620]

              id       date     price  bedrooms  bathrooms  sqft_living  sqft_lot  floors  waterfront  view  condition  grade  sqft_above  sqft_basement  yr_built  yr_renovated  zipcode      lat    long  sqft_living15  sqft_lot15             date_int
17602  795000620 2014-09-24  115000.0         3        1.0         1080      6250     1.0           0     0          2      5        1080              0      1950             0    98168  47.5045 -122.33           1070        6250  1411516800000000000
17603  795000620 2014-12-15  124000.0         3        1.0         1080      6250     1.0           0     0          2      5        1080              0      1950             0    98168  47.5045 -122.33           1070        6250  1418601600000000000
17604  795000620 2015-03-11  157000.0         3        1.0         1080      6250     1.0           0     0          2      5        1080              0      1950             0    98168  47.5045 -122.33           1070        6250  1426032000000000000

In [39]:
df_house_rocket.tail()

               id       date     price  bedrooms  bathrooms  sqft_living  sqft_lot  floors  waterfront  view  condition  grade  sqft_above  sqft_basement  yr_built  yr_renovated  zipcode      lat     long  sqft_living15  sqft_lot15
21608   263000018 2014-05-21  360000.0         3       2.50         1530      1131     3.0           0     0          3      8        1530              0      2009             0    98103  47.6993 -122.346           1530        1509
21609  6600060120 2015-02-23  400000.0         4       2.50         2310      5813     2.0           0     0          3      8        2310              0      2014             0    98146  47.5107 -122.362           1830        7200
21610  1523300141 2014-06-23  402101.0         2       0.75         1020      1350     2.0           0     0          3      7        1020              0      2009             0    98144  47.5944 -122.299           1020        2007
21611   291310100 2015-01-16  400000.0         3       2.50         1600      2388     2.0           0     0          3      8        1600              0      2004             0    98027  47.5345 -122.069           1410        1287
21612  1523300157 2014-10-15  325000.0         2       0.75         1020      1076     2.0           0     0          3      7        1020              0      2008             0    98144  47.5941 -122.299           1020        1357

In [37]:

# pegar os números 
df_house_rocket[df_house_rocket.id.duplicated() == True]

(177, 21)

In [27]:

df_house_rocket[df_house_rocket['id'].duplicated() == False].shape

(21436, 21)

## 3.0 - Análise Exploratória

### 3.1 - Respostas das perguntas de negócio

In [237]:
# 1. Quantas casas estão disponíveis para compra?
    # R: 21436

# Quantidades de registros e quantidade de registros duplicados
print(f'     Total de registros: {df_house_rocket.shape[0]}')
print(f'Total de IDs duplicados: {df_house_rocket["id"].duplicated().sum()}')

# 21613 casas disponíveis para venda, porém, existem id duplicados, então teremos 21613 - 177 duplicados 
print(f' Total real de casas disponíveis: {df_house_rocket.shape[0] - df_house_rocket["id"].duplicated().sum()}')

     Total de registros: 21613
Total de IDs duplicados: 177
 Total real de casas disponíveis: 21436

In [238]:
# 2. Quantos atributos as casas possuem? como não foi explicito, consideramos o id.
    # R: 21
df_house_rocket.shape[1]

21

In [239]:
# 3. Quais são os atributos das casas?
#     - R: ['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
#       'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'grade',
#       'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode',
#       'lat', 'long', 'sqft_living15', 'sqft_lot15']

df_house_rocket.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'grade',
       'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode',
       'lat', 'long', 'sqft_living15', 'sqft_lot15'],
      dtype='object')

In [249]:
# 4. Qual a casa mais cara ( casa com o maior valor de venda )?
#     - R: id: 6762700020 | 7.700.000,00
df_house_rocket[df_house_rocket['price'] == df_house_rocket['price'].max()]

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
7252,6762700020,2014-10-13,7700000.0,6,8.0,12050,27600,2.5,0,3,...,13,8570,3480,1910,1987,98102,47.6298,-122.323,3940,8800

In [248]:
# 5. Qual a casa com o maior número de quartos?
#     - R: id= 2402100895 com 33 quartos
df_house_rocket[df_house_rocket['bedrooms'] == df_house_rocket['bedrooms'].max()]

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
15870,2402100895,2014-06-25,640000.0,33,1.75,1620,6000,1.0,0,0,...,7,1040,580,1947,0,98103,47.6878,-122.331,1330,4700

### 3.2 - Novas Perguntas como exercício

1. Qual a soma total de quartos do conjunto de dados?
2. Quantas casas possuem 2 banheiros?
3. Qual o preço médio de todas as casas no conjunto de dados?
4. Qual o preço médio de casas com 2 banheiros?
5. Qual o preço mínimo entre as casas com 3 quartos?
6. Quantas casas possuem mais de 300 metros quadrados na sala de estar?
6. Quantas casas tem mais de 2 andares?
7. Quantas casas tem vista para o mar?
8. Das casas com vista para o mar, quantas tem 3 quartos?
9. Das casas com mais de 300 metros quadrados de sala de estar, quantas tem mais de 2 banheiros?

In [24]:
# Soma total de quartos
df_house_rocket['bedrooms'].sum()

72854

In [23]:
# Soma total de quartos
df_house_rocket.tail()

               id       date     price  bedrooms  bathrooms  sqft_living  sqft_lot  floors  waterfront  view  condition  grade  sqft_above  sqft_basement  yr_built  yr_renovated  zipcode      lat     long  sqft_living15  sqft_lot15
21608   263000018 2014-05-21  360000.0         3       2.50         1530      1131     3.0           0     0          3      8        1530              0      2009             0    98103  47.6993 -122.346           1530        1509
21609  6600060120 2015-02-23  400000.0         4       2.50         2310      5813     2.0           0     0          3      8        2310              0      2014             0    98146  47.5107 -122.362           1830        7200
21610  1523300141 2014-06-23  402101.0         2       0.75         1020      1350     2.0           0     0          3      7        1020              0      2009             0    98144  47.5944 -122.299           1020        2007
21611   291310100 2015-01-16  400000.0         3       2.50         1600      2388     2.0           0     0          3      8        1600              0      2004             0    98027  47.5345 -122.069           1410        1287
21612  1523300157 2014-10-15  325000.0         2       0.75         1020      1076     2.0           0     0          3      7        1020              0      2008             0    98144  47.5941 -122.299           1020        1357

## 4.0 - Entrega

1. Quantas casas estão disponíveis para compra?
    - R: **21436** casas
2. Quantos atributos as casas possuem?
    - R: **21** atributos das casas
3. Quais são os atributos das casas?
    - R:
|id|date|price|bedrooms|bathrooms|sqft_living|sqft_lot|floors|waterfront|view|condition|grade|sqft_above|sqft_basement|yr_built|yr_renovated|zipcode|lat|long|sqft_living15|sqft_lot15|
|--|--|--|--|--|--|--|--|--|--|--|--|--|--|--|--|--|--|--|--|--|
|- |- |- |- |- |- |- |- |- |- |- |- |- |- |- |- |- |- |- |- |- |

4. Qual a casa mais cara ( casa com o maior valor de venda )?
    - R: id = **6762700020** no valor de **7.700.000,00**
5. Qual a casa com o maior número de quartos?
    - R: id = id **2402100895** com **33** quartos